app/controllers/provinces_controller.rb

SELECT `provinces`.* FROM `provinces`
---
  def index
    @provinces = Province.all

INSERT INTO `provinces` (`name`, `created_at`, `updated_at`) VALUES ('北京', '2018-03-14 13:14:07', '2018-03-14 13:14:07')
---
  def create
    @province = Province.new(province_params)

    respond_to do |format|
      if @province.save

SELECT  `provinces`.* FROM `provinces` WHERE `provinces`.`id` = 1 LIMIT 1
---
    def set_province
      @province = Province.find(params[:id])