app/controllers/wx_users_controller.rb

SELECT `wx_users`.* FROM `wx_users`
---
  def index
    @wx_users = WxUser.all